{
  "Data type": "數據類型",
  "Description": "描述",
  "MySQL Data Types (Version 8.0)": "MySQL資料類型（8.0版）",
  "In MySQL there are three main data types: string, numeric, and date and time.": "在MySQL中，主要有三種數據類型：字符串，數字以及日期和時間。",
  "String Data Types": "字符串數據類型",
  "Numeric Data Types": "數值數據類型",
  "Note: All the numeric data types may have an extra option: UNSIGNED or ZEROFILL. If you add the UNSIGNED option, MySQL disallows negative values for the column. If you add the ZEROFILL option, MySQL automatically also adds the UNSIGNED attribute to the column.": "注意：所有數字數據類型可能都有一個附加選項：UNSIGNED或ZEROFILL。如果添加UNSIGNED選項，則MySQL不允許該列為負值。如果添加ZEROFILL選項，MySQL也會自動將UNSIGNED屬性添加到該列。",
  "Date and Time Data Types": "日期和時間數據類型",
  "SQL Server Data TypesSQL Server": "SQL Server數據類型",
  "Other Data Types": "其他數據類型",
  "MS Access Data Types": "MS Access數據類型",
  "A FIXED length string (can contain letters, numbers, and special characters). The size parameter specifies the column length in characters - can be from 0 to 255. Default is 1": "固定長度的字符串（可以包含字母，數字和特殊字符）。size參數指定以字符為單位的列長度-可以從0到255。默認值為1",
  "A VARIABLE length string (can contain letters, numbers, and special characters). The size parameter specifies the maximum column length in characters - can be from 0 to 65535": "長度可變的字符串（可以包含字母，數字和特殊字符）。size參數指定最大列長度（以字符為單位）-可以從0到65535",
  "Equal to CHAR(), but stores binary byte strings. The size parameter specifies the column length in bytes. Default is 1": "等於CHAR（），但存儲二進製字節字符串。size參數指定列長度（以字節為單位）。默認為1",
  "Equal to VARCHAR(), but stores binary byte strings. The size parameter specifies the maximum column length in bytes.": "等於VARCHAR（），但存儲二進製字節字符串。size參數指定最大列長度（以字節為單位）。",
  "For BLOBs (Binary Large OBjects). Max length: 255 bytes": "對於BLOB（二進制大對象）。最大長度：255個字節",
  "Holds a string with a maximum length of 255 characters": "包含最大長度為255個字符的字符串",
  "Holds a string with a maximum length of 65,535 bytes": "容納最大長度為65,535字節的字符串",
  "For BLOBs (Binary Large OBjects). Holds up to 65,535 bytes of data": "對於BLOB（二進制大對象）。最多可容納65,535個字節的數據",
  "Holds a string with a maximum length of 16,777,215 characters": "包含最大長度為16,777,215個字符的字符串",
  "For BLOBs (Binary Large OBjects). Holds up to 16,777,215 bytes of data": "對於BLOB（二進制大對象）。最多可容納16,777,215字節的數據",
  "Holds a string with a maximum length of 4,294,967,295 characters": "包含最大長度為4,294,967,295個字符的字符串",
  "For BLOBs (Binary Large OBjects). Holds up to 4,294,967,295 bytes of data": "對於BLOB（二進制大對象）。最多可容納4,294,967,295字節的數據",
  "A string object that can have only one value, chosen from a list of possible values. You can list up to 65535 values in an ENUM list. If a value is inserted that is not in the list, a blank value will be inserted. The values are sorted in the order you enter them": "從可能值列表中選擇的只能有一個值的字符串對象。您最多可以在ENUM列表中列出65535個值。如果插入的值不在列表中，則將插入空白值。值按輸入順序排序",
  "A string object that can have 0 or more values, chosen from a list of possible values. You can list up to 64 values in a SET list": "從可能值列表中選擇的可以具有0個或多個值的字符串對象。您可以在SET列表中最多列出64個值",
  "A bit-value type. The number of bits per value is specified in size. The size parameter can hold a value from 1 to 64. The default value for size is 1.": "位值類型。每個值的位數指定大小。size參數的值可以介於1到64之間。size的默認值為1。",
  "A very small integer. Signed range is from -128 to 127. Unsigned range is from 0 to 255. The size parameter specifies the maximum display width (which is 255)": "一個非常小的整數。有符號範圍是從-128到127。無符號範圍是從0到255。size參數指定最大顯示寬度（即255）",
  "Zero is considered as false, nonzero values are considered as true.": "零被認為是假的，非零值被認為是真。",
  "Equal to BOOL": "等於布爾",
  "A small integer. Signed range is from -32768 to 32767. Unsigned range is from 0 to 65535. The size parameter specifies the maximum display width (which is 255)": "一個小整數。有符號範圍是從-32768到32767。無符號範圍是從0到65535。size參數指定最大顯示寬度（即255）。",
  "A medium integer. Signed range is from -8388608 to 8388607. Unsigned range is from 0 to 16777215. The size parameter specifies the maximum display width (which is 255)": "中等整數。有符號的範圍是-8388608至8388607。無符號的範圍是0至16777215。size參數指定最大顯示寬度（即255）。",
  "A medium integer. Signed range is from -2147483648 to 2147483647. Unsigned range is from 0 to 4294967295. The size parameter specifies the maximum display width (which is 255)": "中等整數。有符號的範圍是從-2147483648到2147483647。無符號的範圍是從0到4294967295。size參數指定最大顯示寬度（即255）。",
  "Equal to INT(size)": "等於INT（大小）",
  "A large integer. Signed range is from -9223372036854775808 to 9223372036854775807. Unsigned range is from 0 to 18446744073709551615. The size parameter specifies the maximum display width (which is 255)": "一個大整數。有符號範圍是從-9223372036854775808到9223372036854775807。無符號範圍是從0到18446744073709551615。size參數指定最大顯示寬度（即255）。",
  "A floating point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter. This syntax is deprecated in MySQL 8.0.17, and it will be removed in future MySQL versions": "浮點數。位數總數按大小指定。小數點後的位數在d參數中指定。此語法在MySQL 8.0.17中已棄用，並將在以後的MySQL版本中刪除",
  "A floating point number. MySQL uses the p value to determine whether to use FLOAT or DOUBLE for the resulting data type. If p is from 0 to 24, the data type becomes FLOAT(). If p is from 25 to 53, the data type becomes DOUBLE()": "浮點數。MySQL使用p值來確定對結果數據類型使用FLOAT還是DOUBLE。如果p為0到24，則數據類型為FLOAT（）。如果p為25到53，則數據類型為DOUBLE（）",
  "A normal-size floating point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter": "普通大小的浮點數。位數總數按大小指定。小數點後的位數在d參數中指定",
  "An exact fixed-point number. The total number of digits is specified in size. The number of digits after the decimal point is specified in the d parameter. The maximum number for size is 65. The maximum number for d is 30. The default value for size is 10. The default value for d is 0.": "確切的定點數。位數總數按大小指定。小數點後的位數在d參數中指定。size的最大數量為65。d的最大數量為30。size的默認值為10。d的默認值為0。",
  "Equal to DECIMAL(size,d)": "等於DECIMAL（size，d）",
  "A date. Format: YYYY-MM-DD. The supported range is from '1000-01-01' to '9999-12-31'": "一個約會。格式：YYYY-MM-DD。支持的範圍是從'1000-01-01'到'9999-12-31'",
  "A date and time combination. Format: YYYY-MM-DD hh:mm:ss. The supported range is from '1000-01-01 00:00:00' to '9999-12-31 23:59:59'. Adding DEFAULT and ON UPDATE in the column definition to get automatic initialization and updating to the current date and time": "日期和時間組合。格式：YYYY-MM-DD hh：mm：ss。支持的範圍是從“ 1000-01-01 00:00:00”到“ 9999-12-31 23:59:59”。在列定義中添加DEFAULT和ON UPDATE以獲得自動初始化並更新到當前日期和時間",
  "A timestamp. TIMESTAMP values are stored as the number of seconds since the Unix epoch ('1970-01-01 00:00:00' UTC). Format: YYYY-MM-DD hh:mm:ss. The supported range is from '1970-01-01 00:00:01' UTC to '2038-01-09 03:14:07' UTC. Automatic initialization and updating to the current date and time can be specified using DEFAULT CURRENT_TIMESTAMP and ON UPDATE CURRENT_TIMESTAMP in the column definition": "時間戳記。TIMESTAMP值存儲為自Unix紀元（'1970-01-01 00:00:00'UTC）以來的秒數。格式：YYYY-MM-DD hh：mm：ss。支持的範圍是從UTC的“ 1970-01-01 00:00:01”到UTC的“ 2038-01-09 03:14:07”。可以使用DEFAULT CURRENT_TIMESTAMP和列定義中的ON UPDATE CURRENT_TIMESTAMP來指定自動初始化和更新到當前日期和時間",
  "A time. Format: hh:mm:ss. The supported range is from '-838:59:59' to '838:59:59'": "一次 格式：hh：mm：ss。支持的範圍是'-838：59：59'到'838：59：59'",
  "A year in four-digit format. Values allowed in four-digit format: 1901 to 2155, and 0000. MySQL 8.0 does not support year in two-digit format.": "四位數格式的一年。允許使用四位數格式的值：1901至2155，以及0000。MySQL8.0不支持兩位數格式的year。",
  "Fixed width character string": "定寬字符串",
  "8,000 characters": "8,000個字元",
  "Defined width": "定義寬度",
  "Variable width character string": "可變寬度字符串",
  "2 bytes + number of chars": "2個字節+字符數",
  "1,073,741,824 characters": "1,073,741,824個字符",
  "2GB of text data": "2GB文字數據",
  "4 bytes + number of chars": "4個字節+字符數",
  "Fixed width Unicode string": "固定寬度的Unicode字符串",
  "4,000 characters": "4,000個字符",
  "Defined width x 2": "定義寬度x 2",
  "Variable width Unicode string": "可變寬度Unicode字符串",
  "536,870,912 characters": "536,870,912個字符",
  "Fixed width binary string": "定寬二進製字符串",
  "8,000 bytes": "8,000個字節",
  "Variable width binary string": "可變寬度的二進製字符串",
  "2GB": "2GB",
  "Max size": "最大尺寸",
  "Storag": "貯存",
  "Integer that can be 0, 1, or NULL": "可以為0、1或NULL的整數",
  "Allows whole numbers from 0 to 255": "允許從0到255的整數",
  "1 byte": "1個字節",
  "Allows whole numbers between -32,768 and 32,767": "允許-32,768到32,767之間的整數",
  "2 byte": "2字節",
  "Allows whole numbers between -2,147,483,648 and 2,147,483,647": "允許-2,147,483,648和2,147,483,647之間的整數",
  "4 byte": "4字節",
  "Allows whole numbers between -9,223,372,036,854,775,808 and 9,223,372,036,854,775,807": "允許介於-9,223,372,036,854,775,808和9,223,372,036,854,775,807之間的整數",
  "8 byte": "8字節",
  "Fixed precision and scale numbers. Allows numbers from -10^38 +1 to 10^38 –1. The p parameter indicates the maximum total number of digits that can be stored (both to the left and to the right of the decimal point). p must be a value from 1 to 38. Default is 18. The s parameter indicates the maximum number of digits stored to the right of the decimal point. s must be a value from 0 to p. Default value is 0": "固定的精度和小數位數。 允許數字從-10 ^ 38 +1到10 ^ 38 –1。 p參數指示可以存儲的最大位數（在小數點的左邊和右邊）。 p必須是1到38之間的值。默認值為18。s參數指示存儲在小數點右邊的最大位數。 s必須是從0到p的值。 默認值為0",
  "5-17 bytes": "5-17字節",
  "Monetary data from -214,748.3648 to 214,748.3647": "貨幣數據從-214,748.3648到214,748.3647",
  "4 bytes": "4字節",
  "Monetary data from -922,337,203,685,477.5808 to 922,337,203,685,477.5807": "貨幣數據從-922,337,203,685,477.5808到922,337,203,685,477.5807",
  "8 bytes": "8字節",
  "Floating precision number data from -1.79E + 308 to 1.79E + 308. The n parameter indicates whether the field should hold 4 or 8 bytes. float(24) holds a 4-byte field and float(53) holds an 8-byte field. Default value of n is 53.": "浮動精度數字數據從-1.79E + 308到1.79E +308。n參數指示該字段應容納4個字節還是8個字節。 float（24）保存一個4字節的字段，而float（53）保存一個8字節的字段。 n的默認值為53。",
  "4 or 8 bytes": "4或8個字節",
  "Floating precision number data from -3.40E + 38 to 3.40E + 38": "浮動精度數字數據從-3.40E + 38到3.40E + 38",
  "From January 1, 1753 to December 31, 9999 with an accuracy of 3.33 milliseconds": "從1753年1月1日到9999年12月31日，精度為3.33毫秒",
  "From January 1, 0001 to December 31, 9999 with an accuracy of 100 nanoseconds": "從0001年1月1日到9999年12月31日，精度為100納秒",
  "6-8 bytes": "6-8個字節",
  "From January 1, 1900 to June 6, 2079 with an accuracy of 1 minute": "1900年1月1日至2079年6月6日，精度為1分鐘",
  "Store a date only. From January 1, 0001 to December 31, 9999": "僅存儲日期。 從0001年1月1日到9999年12月31日",
  "3 bytes": "3個字節",
  "Store a time only to an accuracy of 100 nanoseconds": "僅存儲時間至100納秒的精度",
  "3-5 bytes": "3-5個字節",
  "The same as datetime2 with the addition of a time zone offset": "與datetime2相同，但增加了時區偏移",
  "8-10 bytes": "8-10字節",
  "Stores a unique number that gets updated every time a row gets created or modified. The timestamp value is based upon an internal clock and does not correspond to real time. Each table may have only one timestamp variable": "存儲唯一的數字，該數字在每次創建或修改行時都會更新。 時間戳值基於內部時鐘，並不對應於實時。 每個表可能只有一個時間戳變量",
  "Stores up to 8,000 bytes of data of various data types, except text, ntext, and timestamp": "存儲多達8,000個字節的各種數據類型的數據，但text，ntext和timestamp除外",
  "Stores a globally unique identifier (GUID)": "存儲全局唯一標識符（GUID）",
  "Stores XML formatted data. Maximum 2GB": "存儲XML格式的數據。 最大2GB",
  "Stores a reference to a cursor used for database operations": "存儲對用於數據庫操作的游標的引用",
  "Stores a result-set for later processing": "存儲結果集以供以後處理",
  "Use for text or combinations of text and numbers. 255 characters maximum": "用於文本或文本和數字的組合。 最多255個字符",
  "Memo is used for larger amounts of text. Stores up to 65,536 characters. Note: You cannot sort a memo field. However, they are searchable": "備註用於大量文本。 最多存儲65,536個字符。 注意：您不能對備註字段進行排序。 但是，它們是可搜索的",
  "Single precision floating-point. Will handle most decimals": "單精度浮點數。 將處理大多數小數",
  "Double precision floating-point. Will handle most decimals": "雙精度浮點數。 將處理大多數小數",
  "Use for currency. Holds up to 15 digits of whole dollars, plus 4 decimal places. Tip: You can choose which country's currency to use": "用於貨幣。 最多包含15位整數，外加4個小數位。 提示：您可以選擇要使用的國家/地區的貨幣",
  "AutoNumber fields automatically give each record its own number, usually starting at 1": "自動編號字段自動為每個記錄賦予其自己的編號，通常從1開始",
  "Use for dates and times": "用於日期和時間",
  "A logical field can be displayed as Yes/No, True/False, or On/Off. In code, use the constants True and False (equivalent to -1 and 0). Note: Null values are not allowed in Yes/No fields": "邏輯字段可以顯示為“是/否”，“是/否”或“開/關”。 在代碼中，使用常量True和False（等效於-1和0）。 注意：“是/否”字段中不允許使用空值",
  "1 bit": "1位",
  "Can store pictures, audio, video, or other BLOBs (Binary Large OBjects)": "可以存儲圖片，音頻，視頻或其他BLOB（二進制大對象）",
  "up to 1GB": "高達1GB",
  "Contain links to other files, including web pages": "包含指向其他文件（包括網頁）的鏈接",
  "Let you type a list of options, which can then be chosen from a drop-down list": "讓您鍵入選項列表，然後可以從下拉列表中選擇"
}
